x = 38
print('дратути!')

if x < 0:
    print('меньше нуля')
print('дотвидания!')

# примеры

a, b = 10, 5

if a > b:
    print('a > b')

if a > b and a > 0:
    print('успех')

if (a > b) and (a > 0 or b < 1000):
    print('успех2')

if 5 < b and b < 10:
    print('успех3')
print('условие не выполнено')

# можно сравнивать

if '34' > '123':
    print('успех текст (34) > текст (123)')
    print('потому, что')
    print('3', ord('3'))
    print('4', ord('4'))
    print('1', ord('1'))
    print('2', ord('2'))

if '123' > '12':
    print('успех 123 > 12')

if [1, 1] > [1, 2]:
    print('успех [1, 1] > [1, 2]')
else:
    print('no, [1, 1] < [1, 2]')


# что нельзя сравнивать - разные типы

if '6' > 5:
    print('успех')

if [5, 6] > 5:
    print('успех')

# но

if '6' != 5:
    print('успех')
